# Задача 32: Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)

# -5 9 0 3 -1 -2 1 4 -2 10 2 0 -9 8 10 -9 0 -5 -5 7
# 5
# 15
# [1, 9, 13, 14, 19]

list_in = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
a = int(input("Введите минимум: "))
b = int(input("Введите максимум: "))
list_out = []

for i in range(0, len(list_in)):
    if list_in[i] >= a and list_in[i] <= b:
        list_out.append(i)
print(*list_out)